public class JavaApplication {


    public static void main(String[] args) {
        //User 관련 기능 모음집
        // 사용자 등록


        // 모든 사용자 조회

        // 현재 바라보고 있는 사용자 조회


        // 사용자 전환


        // 특정 데이터 조회
//        searchUser();

        // 수정


        //서버 등록


        //유저가 가지고 있는 서버 조회

        // 현재 바라보고 있는 사용자 조회


        // 사용자 전환


        // 특정 데이터 조회
//        searchServer();

        // 수정


        //서버 삭제



        // 서버 삭제 후 모든 서버 조회


        // 채널 등록

        // 모든 채널 조회


        // 현재 바라보고 있는 채널 조회


        // 사용자 전환


        // 특정 채널 조회
//        searchChannel();

        // 채널명 수정


        // 채널 삭제



        // 채널 삭제 후 모든 채널 조회


        // 메시지 생성


        // 채널의 모든 메시지 출력


        // 특정 메시지 삭제


        // 메시지 삭제 후 채널의 모든 메시지 출력



    }
}
